Revit 2027 API
RebarSpliceOptions.SplicePosition Property
 Identifies the splice line position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSplicePosition SplicePosition { get; set; }
Public Property SplicePosition As RebarSplicePosition
	Get
	Set
public:
property RebarSplicePosition SplicePosition {
	RebarSplicePosition get ();
	void set (RebarSplicePosition value);
}
member SplicePosition : RebarSplicePosition with get, set
Property Value
RebarSplicePosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarSpliceOptions Class
Autodesk.Revit.DB.Structure Namespace